In [4]:
import numpy as np
import pandas as pd

In [33]:
df = pd.read_excel("filtered_transactions.xlsx")
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]